'''
                                                homework 16
'''

'''    Task 1. 
Доповніть код так, щоб елемент списку що має значення green, був змінений на значення зелений, 
а елемент violet на фіолетовий.
'''

# rainbow = ['Red', 'Orange', 'Yellow', 'Green', 'Blue', 'Indigo', 'Violet']
# rainbow[3] = 'Зелений'
# rainbow[6] = 'Фіолетовий'
# print(rainbow)

'''    Task 2.
Доповніть код, використовуючи оператори конкатенації (+) та множення списку на число (*) так, щоб він вивів список:
[1, 2, 3, 1, 2, 3, 6, 6, 6, 6, 6, 6, 6, 6, 6, 7, 8, 9, 10, 11, 12, 13]
'''

# numbers1 = [1, 2, 3]
# numbers2 = [6]
# numbers3 = [7, 8, 9, 10, 11, 12, 13]
#
# print(numbers1 * 2 + numbers2 * 9 + numbers3)


'''     Тask 3.
На вхід до програми подається число a, і число b.
Напишіть програму, що виводить список, який складається з числа a, яке повторюється b разів.
'''

# a = [int(input())]
# b = int(input())
# c = a * b
# print(c)


'''
                                                homework 17
'''
'''     Задача 1. 
На вхід до списку подається натуральне число n. Напишіть програму, яка створює список, що складається із 
дільників введеного числа.
'''

# n = int(input('Введіть число:  '))
# b = []
# for i in range(1, n + 1):
#     if n % i == 0:
#         b.append(i)
# print(b)


'''Задача 2. 
На вхід подається натуральне число (n>=2), а після нього вводиться n цілих чисел. Напишіть програму, 
що створює із вказаних чисел список, що складатиметься із суми сусідніх чисел (0 і 1, 1 і 2, 2 і 3…)
'''

# n = int(input('Введіть число n >= 2:  '))
# list_1 = []
# list_2 = []
# if n >= 2:
#     for i in range(1, n + 1):
#         next_cigit = int(input('Введіть число:  '))
#         list_1.append(next_cigit)
#
#     while not len(list_1) == 1:
#         sum_index = list_1[0] + list_1[1]
#         list_2.append(sum_index)
#         del list_1[0]
#     print(list_2)
# else:
#     print('Введіть число побільше')


