'''
                                    Homework 19-20. Методи списків
'''

'''
Task 1.

На вхід в програму подається строка. Напишіть програму, яка визначає найдовше слово. Використайте метод split.
'''

# s = input('Введіть значення:  ')
# print(max(s.split(), key=len))


'''
Task 2.

На вхід в програму подається строка. Напишіть програму, яка виводить строку без повторюваних символів. Використайте 
метод join.
'''

# s = input('Введіть значення:  ')
# y = []
# for i in s:
#     if i not in y:
#         y.append(i)
# print(''.join(y))


'''Task 3. На вхід подається число n. Напишіть програму, яка приймає n чисел, та виводить їх у відсортованому списку 
в порядку зростання, і копію цього ж списку, в відсортованому в порядку спадання.
'''

# n = int(input('Введите число:  '))
# lst = []
#
# for i in range(n):
#     m = int(input('Введите число:  '))
#     lst.append(m)
# lst.sort()
# lst_2 = lst.copy()
# lst_2.reverse()
# print(lst)
# print(lst_2)


'''
Task 4. 
На вхід подається список посилань без вказаного протоколу. Напишіть програму, що виведе нам цей список із 
вказаним протоколом https://, а також із закінченням url на /robots.txt
# '''


# n = input('Введіть посилання').split()
# prot = 'https://'
# robots = '/robots.txt'
# lst = []
# for i in n:
#     total = prot + i + robots
#     lst.append(total)
# print(lst)
