import datetime
import time
from time import sleep




# Задача 1

# num1 = int(input('введите первое число'))
# num2 = int(input('введите второе число'))
# num3 = int(input('введите третье число'))
#
# print(num1 + num2 + num3)
#
#
# # Задача 2

run = input( "Run")
stop = input('Stop')
run_time = datetime.datetime.now()
run_time1 = datetime.datetime.now()

print(f'Програма {run} виконувалась {run_time}', '\n', f'Програма {stop} виконувалась {run_time1}')


# print(f'Програма {run} виконувалась {run_time}')
# sleep(2)
# print(f'Програма {stop} виконувалась {run_time1}')
