"""
Task 1

На вхід до програми подається послідовність слів, кожне слово на окремому рядку. Кінцем послідовності є одне із трьох
слів: «стоп», «вистачить», «досить» (маленькими літерами, без лапок). Напишіть програму, яка виводить загальну
кількість членів цієї послідовності.

"""

# text = input('Введіть слово:  ')
# count = 0

# while text != 'стоп' and text != 'вистачить' and text != 'досить':
#     count += 1
#     text = input('Введіть інше слово:  ')
# print(count)


'''
Task 2

В Україні існують монети (КОПІЙКИ) з номіналами 1, 2, 5, 10, 25, 50. Для того, щоб придбати щось в магазині, 
і не носити важкий гаманець, кращим виходом буде взяти найменшу кількість монет в ціні товару.
Напишіть програму, яка визначає яку мінімальну кількість монет (КОПІЙОК) можна взяти з собою, щоб заплатити за товар.

'''

# num = int(input('Ціна за товар:  '))
# total = 0
#
# while num >= 50:
#     total += 1
#     num -= 50
#
# while num >= 25:
#     total += 1
#     num -= 25
#
# while num >= 10:
#     total += 1
#     num -= 10
#
# while num >= 5:
#     total += 1
#     num -= 5
#
# while num >= 2:
#     total += 1
#     num -= 2
#
# while num == 1:
#     total += 1
#     num -= 1
#
# print(total)