'''
                                                Homework 13
'''
import math
from math import ceil

'''
Task 1

На вхід до програми подається одна строка. Напишіть програму, яка виводить у стовпчик елементи рядка у зворотному 
порядку.
'''

# n = input()
# for i in range(len(n)):
#     print(n[::-1][i])

'''
На вхід програмі подається одна строка, що складається з цифр. Напишіть програму, яка рахує суму цифр цієї строки.
'''

# n = input()
# b = int(n)
# total = 0
# while b != 0:
#     num = b % 10
#     total += num
#     b //= 10
# print(total)

'''
Task 3

На вхід до програми подається одна строка. Напишіть програму, яка виводить повідомлення «Цифра» (без лапок), 
якщо рядок містить цифру. В іншому випадку вивести повідомлення "Цифр немає" (без лапок).
'''

# n = input('Впишіть значення:  ')
#
# if n.isalpha():
#     print('Цифр немає')
# elif n.isalnum():
#     print('Цифра')


'''
                                                Homework 14
'''

'''
task 1

На вхід до програми подається одна строка. Напишіть програму, яка виводить:
1 третій символ строки
2 передостанній символ строки
3 перші п’ять символів строки
4 всю строку крім останніх двох символів
5 всі символи з парними індексами
6 всі символи з непарними індексами
7 всі символи в зворотньому порядку
8 всі символи строки через один в зворотньому напрямку, починаючи з останнього символу
'''

# n = input('Впишіть значення:  ')
#
# print(n[2:3])
# print(n[-2])
# print(n[:5])
# print(n[:-2])
# print(n[:: 2])
# print(n[1:: 2])
# print(n[:: -1])
# print(n[-1:: -2])


'''
task 2

На вхід до програми подається строка тексту. Напишіть програму, яка розріже її на дві рівні частини, переставить їх 
місцями та виведе на екран.
'''

# n = input('Впишіть значення:  ')
# n1 = n[:len(n) // 2]
# n2 = n[len(n) // 2:]
# print(n2 + n1)


'''
                                                    Homework 15 
                                                    String methods
'''

'''
task 1

Напишіть програму, що має строку, яка складається з:
Введенної з клавіатури користувачем str. 
Змінна a = “ “,		  # пробіл
Змінна b = “hello”.
Та за допомогою методів, отримує наступну інформацію про цю строку.
1 кількість символів у цій строці
2 всю строку у верхньому регістрі
3 всю строку у нижньому регістрі
4 всю строку, де кожне слово починається з великої (заглавної) літери
5 всю строку, де всі слова розділяються нижнім підкресленням “_”, а не пробілом “ “
6 строку, з заміненим словом hello, на слово Hi!
індекс входження літер “ll”
індекс входження значення змінної b
'''

# n = input()
# a = ' '
# b = "hello"
# f = n + a + b
# print(len(f))
# print(f.upper())
# print(f.lower())
# print(f.title())
# print('_'.join(f.split()))
# print(f.replace('hello', 'Hi!'))
# print(f.index('ll'))
# print(f.index(b, 0))






'''
task 2

На вхід в програму подається строка.Напишіть програму, яка визначає:
Кількість слів у тексті
Кількість літер “а” у тексті (в будь-якому регістрі)
Найдовше слово у тексті
Кількість голосних літер у тексті (приймаємо, що текст буде англійською, і голосні літери такі - 'aeiou'
'''


# n = input('Введіть текст:  ')
# b = ['a', 'e', 'i', 'o', 'u']
# c = n.count(' ') + 1
# a = n.lower().count('a')
# total = 0
# print('Кількість слів у тексті =', c)
# print('Кількість літер а (у всіх регістрах) у тексті = ', a)
# print('Найдовше слово у тексті = ', max(n.split(), key=len))
#
# for i in n.lower():
#     if i in b:
#         total += 1
# print('Кількість голосних літер у тексті =', total)

